app/views/library_management/_fines.html.erb

SELECT "issue_books".* FROM "issue_books"  WHERE "issue_books"."student_id" = 5
SELECT  "fines".* FROM "fines"  WHERE "fines"."issue_book_id" = 4 LIMIT 1
---
      <% @student.each_with_index do |student,i|%>
        <% IssueBook.where(student_id:student.id).each do |issuebook|%>
          <%if fine=Fine.where(issue_book_id:issuebook.id).take%>

SELECT  "students".* FROM "students"  WHERE "students"."id" = $1 LIMIT 1  [["id", 5]]
---
          	 	<td><%=i+1 %></td>
          	 	<td><%= fine.issue_book.student.first_name%>(<%= fine.issue_book.student.admission_no%>)</td>