app/views/library_management/books.html.erb

SELECT "books_tags"."tag_id" FROM "books_tags"  WHERE "books_tags"."book_id" = 1
---
          <td class="col-7"><%=b.author%></td>
          <td class="col-7"><%Tag.where(id: BooksTag.where(book_id: b).pluck(:tag_id)).each do|booktag| %>