app/controllers/barcodes_controller.rb

SELECT "books".* FROM "books"  WHERE (book_no='so')
SELECT  "tags".* FROM "tags"  WHERE "tags"."name" = 'ttt' LIMIT 1
---
	def manage_barcode
		if params[:search].eql? "book_number"
			@infos=Book.where("book_no='#{params[:value]}'")

		elsif params[:search].eql? "title"
			@infos=Book.where("title='#{params[:value]}'")

	    elsif params[:search].eql? "author"
			@infos=Book.where("author='#{params[:value]}'")

	    elsif params[:search].eql? "tag"
	    	@tag=Tag.find_by_name(params[:value])

SELECT  "books".* FROM "books"  WHERE "books"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "books" SET "barcode_no" = $1, "updated_at" = $2 WHERE "books"."id" = 3  [["barcode_no", "jujuju"], ["updated_at", "2014-11-03 05:44:41.859041"]]
---
	def update_barcode
		p "iiiiii"
		@barcode=params[:barcode]
		p @barcode
		@barcode.each_pair do |k,v|
			book=Book.find(k)
			p book
			 book.update(barcode_no:v)