app/controllers/library_management_controller.rb

INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-04 13:49:26.844498"], ["name", "t"], ["updated_at", "2014-11-04 13:49:26.844498"]]
INSERT INTO "books" ("author", "book_no", "created_at", "status", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author", "rrr"], ["book_no", 1000], ["created_at", "2014-11-04 13:49:26.971878"], ["status", "Available"], ["title", "Ruby"], ["updated_at", "2014-11-04 13:49:26.971878"]]
---
  def saveNewBook
    if params[:type]=='1'

      p "----------haha in 1"

      @cust_tag= params["cust_tag"]
      p  params["tag_ids"]
      unless params["cust_tag"][0].nil?
      @cust_tag_tmp=Tag.create(name: @cust_tag)
      end
      params[:no_of_cpoies].to_i.times do |i|

        @book = Book.new
        @book.book_no = params["book"]["book_no"].to_i+i
        @book.title =params["book"]["title"]
        @book.author=params["book"]["author"]
        @book.status="Available"
       if @book.save