app/controllers/library_management_controller.rb

SELECT "books".* FROM "books"
---
  def books
    @books = Book.all

SELECT  "books".* FROM "books"   ORDER BY "books"."id" DESC LIMIT 1
---
  def add_books
    @book = Book.new

    if Book.first.nil?

INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-06 13:40:51.308702"], ["name", "rrrr"], ["updated_at", "2014-11-06 13:40:51.308702"]]
INSERT INTO "books" ("author", "book_no", "created_at", "status", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author", "rr"], ["book_no", 1003], ["created_at", "2014-11-06 13:40:51.385538"], ["status", "Available"], ["title", "rubyrail"], ["updated_at", "2014-11-06 13:40:51.385538"]]
INSERT INTO "books_tags" ("book_id", "created_at", "tag_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["book_id", 9], ["created_at", "2014-11-06 13:40:51.446410"], ["tag_id", 18], ["updated_at", "2014-11-06 13:40:51.446410"]]
---
  def save_new_book
    if params[:type]=='1'

      @cust_tag= params["cust_tag"]

      unless params["cust_tag"][0].nil?
      @cust_tag_tmp=Tag.create(name: @cust_tag)
      end
      if params[:no_of_cpoies].to_i<1.to_i
       flash[:alert]="Number of copies can not be less than one"
       @book = Book.new
       render library_management_addbooks_path
      else


      params[:no_of_cpoies].to_i.times do |i|

        @book = Book.new
        @book.book_no = params["book"]["book_no"].to_i+i
        @book.title =params["book"]["title"]
        @book.author=params["book"]["author"]
        @book.status="Available"
       if @book.save
         begin

          params["tag_ids"].each do |k|
          @book.books_tag.create(book_id:params["book_id"],tag_id: k)

SELECT  "books".* FROM "books"  WHERE "books"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "books_tags".* FROM "books_tags"  WHERE "books_tags"."book_id" = $1  [["book_id", 2]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 2]]
DELETE FROM "books_tags" WHERE "books_tags"."book_id" = $1  [["book_id", 2]]
---
 def delete_book
  @book=Book.find(params[:id])
     @book.books_tag.each do |books_tag|
          books_tag.destroy

SELECT "tags".* FROM "tags"  WHERE (name like '%')
---
def search_tags
    # unless params[:name].empty?
     @tags=Tag.where("name like '#{params[:name]}%'")

SELECT "tags".* FROM "tags"  WHERE (name like '%')
---
  def manage_tags
     @tags=Tag.where("name like '#{params[:name]}%'")

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 17]]
DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 17]]
SELECT "tags".* FROM "tags"
---
  def delete_tag
    @tag=Tag.find(params[:id])
         @tag.destroy
         @tags=Tag.all

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 16]]
---
     def edit_tag
      @tag=Tag.find(params[:id])

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 16]]
UPDATE "tags" SET "name" = $1, "updated_at" = $2 WHERE "tags"."id" = 16  [["name", "uit"], ["updated_at", "2014-11-06 11:23:52.513946"]]
SELECT "tags".* FROM "tags"
---
     def update_tag

      @tag=Tag.find(params[:id])
       @tag.update(get_tag)
        flash[:notice]="Tag Update Successfully"
      @tags=Tag.all

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 16]]
---
     def tag_related_book
      @tag=Tag.find(params[:id])

SELECT "students".* FROM "students"  WHERE (first_name LIKE 's%'
SELECT "fines".* FROM "fines"  WHERE ("fines"."created_at" BETWEEN '' AND '')
---
  def detail_fine

    if params[:name].present?
       @student=Student.where("first_name LIKE '#{params[:name]}%'
        OR admission_no='#{params[:name]}'")
    else
      p "-----------"
      startdate=params[:start_date]
        enddate=params[:end_date]

      @student=[]
      @fines=Fine.where(created_at:startdate..enddate)

SELECT "books".* FROM "books"  WHERE (title='yyy')
---
  def manage_barcode
    if params[:search].eql? "book_number"
      @infos=Book.where("book_no='#{params[:value]}'")

SELECT  "books".* FROM "books"  WHERE "books"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "books" SET "barcode_no" = $1, "updated_at" = $2 WHERE "books"."id" = 4  [["barcode_no", "yyyy"], ["updated_at", "2014-11-06 11:46:15.318541"]]
---
  def update_barcode
     error=false
    @barcode=params[:barcode]

    @barcode.each_pair do |k,v|
      book=Book.find(k)

      unless book.update(barcode_no:v)