app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"  WHERE (name like 'w%')
---
	def search_tags
		# unless params[:name].empty?
	   @tags=Tag.where("name like '#{params[:name]}%'")

SELECT "tags".* FROM "tags"  WHERE (name like '%')
---
	def manage_tags
     @tags=Tag.where("name like '#{params[:name]}%'")

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 10]]
DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 10]]
SELECT "tags".* FROM "tags"
---
	def delete_tag
		@tag=Tag.find(params[:id])
         @tag.destroy
         @tags=Tag.all

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 6]]
---
     def edit_tag
     	@tag=Tag.find(params[:id])

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "tags" SET "name" = $1, "updated_at" = $2 WHERE "tags"."id" = 6  [["name", "wezerrt"], ["updated_at", "2014-11-04 13:44:55.099867"]]
SELECT "tags".* FROM "tags"
---
     def update_tag

     	@tag=Tag.find(params[:id])
     	@tag.update(get_tag)
     	@tags=Tag.all

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 6]]
---
     def tag_related_book
     	@tag=Tag.find(params[:id])